# Librerías

In [11]:
import pandas as pd
import numpy as np

AttributeError: partially initialized module 'pandas' from 'C:\Users\SALCIDOA\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.13_qbz5n2kfra8p0\LocalCache\local-packages\Python313\site-packages\pandas\__init__.py' has no attribute 'core' (most likely due to a circular import)

Para el mes de julio revisar:
- Sandra Morales Aguilar
- Comisionista tamaulipas
- Ulises san martin

#Datos

In [1]:
Nombre="sept"+".xlsx"

In [2]:

Guardarcomo="Si vale "+"sept_2025"+".xlsx"

In [3]:
Referencia = "Septiembre 2025"

# Proceso de limpieza de la guía de Ángel

AQUI SE OBTIENE EL DF EN SUCIO Y EL DATAFRAME QUE SE PROCESARA

In [7]:
path_archivo = r"C:\Users\SALCIDOA\Downloads\archivo_para_probar_si_vale.xlsx"
dfsucio=pd.read_excel(path_archivo, skiprows=[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15])
df=dfsucio.copy()
df=df[(df["IVA"]!=0) & (df["Importe"]!=0) & (df["Cargo"]!=0)]
df=df.reset_index()
df=df.drop('index',axis=1)
df=df[["Nombre\nEmpleado","Cargo","Importe","IVA"]]
df=df.rename(columns={'Nombre\nEmpleado':"Nombre Empleado"})
df

NameError: name 'pd' is not defined

Hasta aquí ya tenemos la tabla lista y limpia para seguir con el proceso que marca el manual de ángel.

In [34]:
# Proceso que imita la primera  tabla dinámica

df=df.groupby(['Nombre Empleado']).sum()
df=df.reset_index()
#df.drop(columns=['No.Trx', 'Precio Unitario ', 'Litros'], inplace= True )
#df=df.append({"Nombre Empleado":"Total","Cargo":df.Cargo.sum(),"IVA":df.IVA.sum(), "Importe": df.Importe.sum()}, ignore_index=True)
S=pd.Series({"Nombre Empleado":"Total", "Importe": df.Importe.sum(),"Cargo":df.Cargo.sum(),"IVA":df.IVA.sum()})
df=pd.concat([df, S.to_frame().T], ignore_index=True)
df

     Nombre Empleado     Cargo     Importe        IVA
0     UNIDAD APODACA  14076.14  12134.5944  1941.5456
1  UNIDAD CUAUTITLAN   6615.67   5703.1543   912.5157
2      UNIDAD PUEBLA  16271.51  14027.1803  2244.3297
3       UNIDAD RUBIN   5407.74   4661.8248   745.9152
4       UNIDAD VESTA  44538.33  38395.1492  6143.1808
5              Total  86909.39   74921.903  11987.487

In [35]:
df1=df.copy()
dftd1=df.copy()
df1

     Nombre Empleado     Cargo     Importe        IVA
0     UNIDAD APODACA  14076.14  12134.5944  1941.5456
1  UNIDAD CUAUTITLAN   6615.67   5703.1543   912.5157
2      UNIDAD PUEBLA  16271.51  14027.1803  2244.3297
3       UNIDAD RUBIN   5407.74   4661.8248   745.9152
4       UNIDAD VESTA  44538.33  38395.1492  6143.1808
5              Total  86909.39   74921.903  11987.487

In [36]:
#df2=pd.read_excel("/content/drive/MyDrive/Si Vale Gasolina Empleados y cc/Base si vale gasolina.xlsx")
enlace = r"https://docs.google.com/spreadsheets/d/1Iy68cztYlqI6fLjE8l4s2D32BQLzUZG9/export?format=xlsx"
df2=pd.read_excel(enlace)

df3=df2.copy()
df3

      CC           Nombre Empleado
0   BZ07  AGUSTIN ZAMUDIO GRANADOS
1   D981              ANGEL ZAPATA
2   D941      ANGELA MARIA NIETO H
3   BZ02     ARACELI LOZANO MEDINA
4   E914   ARTURO ANAYA RODRIGUEZ
..   ...                       ...
69  C266    SANDRA MORALES AGUILAR
70  BZ08     JESUS ARTURO ALVAREZ
71  E901       MARTIN FELIPE LOPEZ
72  C203                 MTTO SMA
73  BZ15        JUAN MANUEL NABOR

[74 rows x 2 columns]

In [37]:
# @title Texto de título predeterminado
df=pd.merge( df1, df3, on='Nombre Empleado', how='left')

df=df.reindex(["CC","Nombre Empleado","Cargo","Importe","IVA"],axis=1)

df

    CC    Nombre Empleado     Cargo     Importe        IVA
0  NaN     UNIDAD APODACA  14076.14  12134.5944  1941.5456
1  NaN  UNIDAD CUAUTITLAN   6615.67   5703.1543   912.5157
2  NaN      UNIDAD PUEBLA  16271.51  14027.1803  2244.3297
3  NaN       UNIDAD RUBIN   5407.74   4661.8248   745.9152
4  NaN       UNIDAD VESTA  44538.33  38395.1492  6143.1808
5  NaN              Total  86909.39   74921.903  11987.487

# verificación

In [40]:
datos_faltantes=df[df["CC"].isnull()]
if (not datos_faltantes.empty):
  print( "Datos faltantesen CC :\n"+ str(datos_faltantes))
else:
  print("Todo ok")

Datos faltantesen CC :
    CC Nombre Empleado     Cargo    Importe        IVA
5  NaN           Total  86909.39  74921.903  11987.487

In [41]:
datos_faltantes=datos_faltantes.reset_index()
#datos_faltantes

for i in range (len(datos_faltantes)-1):
  j=datos_faltantes["index"][i]
  cc=input("Introduzca el CC de "+str(datos_faltantes["Nombre Empleado"][i]))
  centro=cc.upper()
  df.loc[j,"CC"]=centro
  S=pd.Series({"CC":centro,"Nombre Empleado":datos_faltantes["Nombre Empleado"][i]})
  df3=pd.concat([df3, S.to_frame().T], ignore_index=True)

camiones= ['TRAILER 001','TRAILER 002', 'TRAILER 004', 'TRAILER 05' ]
df3=df3[~ df3['Nombre Empleado'].isin(camiones) ]
df3=df3.reset_index(drop=True)
#df3.to_excel("/content/drive/MyDrive/Si Vale Gasolina Empleados y cc/Base si vale gasolina.xlsx", index= False)

In [ ]:
df3.to_excel("/content/drive/MyDrive/Si Vale Gasolina Empleados y cc/Base si vale gasolina.xlsx", index= False)

# Segunda tabla dinámica  y poliza

In [42]:
df[["Cargo","Importe","IVA"]]=df[["Cargo","Importe","IVA"]].astype("float64")
#df=df.round(0)
df

     CC    Nombre Empleado     Cargo     Importe         IVA
0  C101     UNIDAD APODACA  14076.14  12134.5944   1941.5456
1  C101  UNIDAD CUAUTITLAN   6615.67   5703.1543    912.5157
2  C101      UNIDAD PUEBLA  16271.51  14027.1803   2244.3297
3  C101       UNIDAD RUBIN   5407.74   4661.8248    745.9152
4  C384       UNIDAD VESTA  44538.33  38395.1492   6143.1808
5   NaN              Total  86909.39  74921.9030  11987.4870

In [43]:
df4=df.copy()
df4["CC"]=df4["CC"].str.upper()
df4=df4.groupby("CC").sum()

In [44]:
df4

,Nombre Empleado,Cargo,Importe,IVA
CC,,,,
C101,UNIDAD APODACAUNIDAD CUAUTITLANUNIDAD PUEBLAUN...,42371.06,36526.7538,5844.3062
C384,UNIDAD VESTA,44538.33,38395.1492,6143.1808

In [45]:
df4=df4.reset_index()
#df4=df4.append({"CC":"Total","Cargo":df4.Cargo.sum(),"Importe": df4.Importe.sum(),"IVA":df4.IVA.sum()}, ignore_index=True)
S=pd.Series({"CC":"Total","Cargo":df4.Cargo.sum(),"Importe": df4.Importe.sum(),"IVA":df4.IVA.sum()})
df4=pd.concat([df4, S.to_frame().T], ignore_index=True)
df4["Cargo"]=df4.Cargo.astype('float')
df4["IVA"]=df4.IVA.astype('float')
df4["Importe"]=df4.Importe.astype('float')
df4= df4.round(0)
df4=df4.drop(['Nombre Empleado'],axis=1)
df4

      CC    Cargo  Importe      IVA
0   C101  42371.0  36527.0   5844.0
1   C384  44538.0  38395.0   6143.0
2  Total  86909.0  74922.0  11987.0

In [46]:
df4

      CC    Cargo  Importe      IVA
0   C101  42371.0  36527.0   5844.0
1   C384  44538.0  38395.0   6143.0
2  Total  86909.0  74922.0  11987.0

In [47]:
# Empecemos a definr las ctas contables que usaremos de acuerdo al catalogo de cuentas

CF='64911801CF01'  # Centro de costos A,B,C Y D941  a D950

GA='64911801GA01'  # Centro de costos E

GV='64911801GV01'  # Centro de costo D981

IVA_por_acreditable= '140104010002'  # Sin centro de costo



Prov_consumo_Sivale= '240112900007' # Para el Centro de costo E913

In [48]:
# Definimos nuestros CC con su Centro utilitario
enlace = r"https://docs.google.com/spreadsheets/d/1gnfLiD1arrr5G7seQi85-f3Cd5n7_miS/export?format=xlsx"
#utilitario= pd.read_excel('/content/drive/MyDrive/Si Vale Gasolina Empleados y cc/CC y utilitario.xlsx')
utilitario= pd.read_excel(enlace)
utilitario

      CC UTILITARIO
0   BI77     IN3301
1   BV05     IN1305
2   BZ01     IN3101
3   BZ02     IN3101
4   BZ04     IN3101
5   BZ05     IN3101
6   BZ07     IN3101
7   BZ08     IN3101
8   BZ09     IN3101
9   BZ11     IN3101
10  BZ13     IN3101
11  BZ14     IN3101
12  BZ15     IN3101
13  C002     IN1101
14  C101     IN5101
15  C102     IN1101
16  C203     IN1101
17  C267     IN3301
18  C555     IN3301
19  C556     IN3301
20  D941     IN1101
21  D942     IN1101
22  D943     IN5101
23  D947     IN2101
24  D948     IN1101
25  D981     IN1101
26  E901     IN5101
27  E902     IN5101
28  E903     IN5101
29  E904     IN5101
30  E908     IN5101
31  E910     IN5101
32  E911     IN5101
33  E912     IN5101
34  E913     IN5101
35  E913     IN5101
36  E914     IN5101
37  E935     IN5101
38  A00P     IN1101
39  A01K     IN1101
40  C266     IN3301
41  E937     IN5101

Ahora, crearemos un df con las columnas:

Plantilla, cons,compañia,cta, CC , Centro Utilitario ,debe/haber, importe, ref

In [49]:
df_parapoliza= df4.copy()
df_parapoliza['CC']=df_parapoliza['CC'].str.strip()
df_parapoliza

      CC    Cargo  Importe      IVA
0   C101  42371.0  36527.0   5844.0
1   C384  44538.0  38395.0   6143.0
2  Total  86909.0  74922.0  11987.0

In [50]:
df_parapoliza=pd.merge(df_parapoliza,utilitario, on=["CC"], how="left")

df_parapoliza['CC']=df_parapoliza['CC'].replace("Total", "E913")

df_parapoliza

     CC    Cargo  Importe      IVA UTILITARIO
0  C101  42371.0  36527.0   5844.0     IN5101
1  C384  44538.0  38395.0   6143.0        NaN
2  E913  86909.0  74922.0  11987.0        NaN

# Verificamos centro utilitarios

In [51]:
datos_faltantes=df_parapoliza[df_parapoliza["UTILITARIO"].isnull()]
if (not datos_faltantes.empty):
  print( "Datos faltantesen CC :\n"+ str(datos_faltantes))
else:
  print("Todo ok")

Datos faltantesen CC :
     CC    Cargo  Importe      IVA UTILITARIO
1  C384  44538.0  38395.0   6143.0        NaN
2  E913  86909.0  74922.0  11987.0        NaN

In [52]:
datos_faltantes=datos_faltantes.reset_index()
#datos_faltantes

for i in range (len(datos_faltantes)-1):

  if datos_faltantes["CC"][i]!="E913":

    j=datos_faltantes["index"][i]

    uti=input("Introduzca el centro utilitario de "+str(datos_faltantes["CC"][i]))

    uti=uti.upper()

    df_parapoliza.loc[j,"UTILITARIO"]=uti

    S=pd.Series({"CC":datos_faltantes["CC"][i],"UTILITARIO": uti })

    utilitario=pd.concat([utilitario, S.to_frame().T], ignore_index=True)

In [ ]:
utilitario.to_excel("/content/drive/MyDrive/Si Vale Gasolina Empleados y cc/CC y utilitario.xlsx", index= False)

# Archivo final :3

In [61]:
df_parapoliza=df_parapoliza[['CC','UTILITARIO' ,'Importe', 'IVA', 'Cargo']]
df_parapoliza

     CC UTILITARIO  Importe      IVA    Cargo
0  C101     IN5101  36527.0   5844.0  42371.0
1  C384     IN5101  38395.0   6143.0  44538.0
2  E913        NaN  86909.0  11987.0  86909.0
3              NaN      NaN      NaN      NaN
4              NaN      NaN      NaN      NaN
5              NaN      NaN      NaN      NaN

In [62]:
df_parapoliza.loc[len(df_parapoliza)-1, 'Importe'] = df_parapoliza.loc[len(df_parapoliza)-1, 'Cargo']


S=pd.Series({"CC":"","UTILITARIO": np.nan, 'Importe': df_parapoliza.loc[len(df_parapoliza)-1, 'IVA'] })



df_parapoliza=pd.concat([df_parapoliza, S.to_frame().T], ignore_index=True)

df_parapoliza

     CC UTILITARIO  Importe      IVA    Cargo
0  C101     IN5101  36527.0   5844.0  42371.0
1  C384     IN5101  38395.0   6143.0  44538.0
2  E913        NaN  86909.0  11987.0  86909.0
3              NaN      NaN      NaN      NaN
4              NaN      NaN      NaN      NaN
5              NaN      NaN      NaN      NaN
6              NaN      NaN      NaN      NaN

In [64]:
Referencia = "01"

In [65]:
df_parapoliza.insert(0, 'plantilla', ['SVA' for i in range(len(df_parapoliza))] )
df_parapoliza.insert(1, 'cons', [i+1 for i in range(len(df_parapoliza))] )
df_parapoliza.insert(2, 'comp', ['100' for i in range(len(df_parapoliza))] )


cta=[]

for i in range(len(df_parapoliza)):

  CC= df_parapoliza.loc[i, 'CC']

  if not  CC.startswith('E')  and  CC != "D981" and CC !="":
    cta.append(CF)

  elif CC.startswith('E') and CC!="E913" :
    cta.append(GA)

  elif CC=="D981" and CC !="" :
    cta.append(GV)

  elif CC=="E913" and CC !="" :

    cta.append(Prov_consumo_Sivale)

  elif CC== "":

    cta.append(IVA_por_acreditable)

df_parapoliza.insert(3, 'cta', cta)

df_parapoliza.insert(6, 'nada', [np.nan for i in range(len(df_parapoliza))] )

df_parapoliza.insert(7, 'nada1', [np.nan for i in range(len(df_parapoliza))] )

df_parapoliza.insert(8, 'debe/haber', [1 if df_parapoliza.loc[i, 'cta'] .startswith('6') or df_parapoliza.loc[i, 'cta'] .startswith('1')  else 2 for i in range(len(df_parapoliza))] )

df_parapoliza.drop(columns=['IVA','Cargo'], inplace= True)

df_parapoliza["ref"]= [ 'Consumo Si Vale '+ Referencia for i in range(len(df_parapoliza))]

df_parapoliza["CC"]=df_parapoliza["CC"].replace("", np.nan)

df_parapoliza

ValueError: cannot insert plantilla, already exists

In [ ]:
with pd.ExcelWriter(Guardarcomo) as writer:
  dfsucio.to_excel(writer,sheet_name="Sheet1")
  dftd1.to_excel(writer, sheet_name="Hoja2",index=False, startcol=0)
  df.to_excel(writer, sheet_name="Hoja2", index= False, startcol=7)
  df4.to_excel(writer,sheet_name="Hoja3", index= False)
  df_parapoliza.to_excel(writer,sheet_name="tfgld013", index= False, header= False)